<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"56e2e27a655d8e6b7999f9e582fb7cf72faa9f593ca4a27fc587ad821ef996ea","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1410 at https://github.com/cal-itp/data-infra/actions/runs/21645044258","plan_out_hash":"33efa68a8760032c643e956ba156e5a3a6bd32b7e23b1226ddf113239fe74491","plan_hash":"721fbac79824d1ca0eaa40badca22ddf0bba4b37f341e7c95c65cca1a0f2b2c4","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 10 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "57EeAg==" -> (known after apply)
!~      detect_md5hash      = "kwmnFy/FxUr7dnmDCPosRA==" -> "different hash"
!~      generation          = 1770075444594332 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "kwmnFy/FxUr7dnmDCPosRA==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_unzip_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "VGfPhg==" -> (known after apply)
!~      detect_md5hash      = "2ZK79GTQ8yecavoJT5etRA==" -> "different hash"
!~      generation          = 1770075444703315 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_unzip_hook.py"
!~      md5hash             = "2ZK79GTQ8yecavoJT5etRA==" -> (known after apply)
        name                = "plugins/hooks/gtfs_unzip_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FX2mrw==" -> (known after apply)
!~      detect_md5hash      = "W9kUYai6r7vIvglNB7RbRQ==" -> "different hash"
!~      generation          = 1770075444691598 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "W9kUYai6r7vIvglNB7RbRQ==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "MBwK0w==" -> (known after apply)
!~      detect_md5hash      = "B0tjZ6Mk+FcRPHbxEm9Ryw==" -> "different hash"
!~      generation          = 1770075444597508 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "B0tjZ6Mk+FcRPHbxEm9Ryw==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "9fno4A==" -> (known after apply)
!~      detect_md5hash      = "N4XY9eVgVQzOJVHhLIMmVg==" -> "different hash"
!~      generation          = 1770075444690072 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "N4XY9eVgVQzOJVHhLIMmVg==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Fb30Vg==" -> (known after apply)
!~      detect_md5hash      = "Gv1WkUpcJDSAE2xIrwJBPA==" -> "different hash"
!~      generation          = 1770146824123009 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "Gv1WkUpcJDSAE2xIrwJBPA==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FDzk3g==" -> (known after apply)
!~      detect_md5hash      = "cJftSH+yHJ5jGmOH375thQ==" -> "different hash"
!~      generation          = 1770075444598576 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "cJftSH+yHJ5jGmOH375thQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "kX9glw==" -> (known after apply)
!~      detect_md5hash      = "TCQBdT8Ew3qt3H/fmJDIbw==" -> "different hash"
!~      generation          = 1770075444617026 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "TCQBdT8Ew3qt3H/fmJDIbw==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "YK2J1g==" -> (known after apply)
!~      detect_md5hash      = "l/UxmEU58oBJjo8zKz5ldw==" -> "different hash"
!~      generation          = 1770146825946815 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "l/UxmEU58oBJjo8zKz5ldw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "gwxvjw==" -> (known after apply)
!~      detect_md5hash      = "WYJPTdGijZUMvDlivz71bg==" -> "different hash"
!~      generation          = 1770146826431352 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "WYJPTdGijZUMvDlivz71bg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 10 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1410](https://github.com/cal-itp/data-infra/actions/runs/21645044258)